Revit 2027 API
CompoundStructure.GetFirstCoreLayerIndex Method
 Gets the index of the first core layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetFirstCoreLayerIndex()
Public Function GetFirstCoreLayerIndex As Integer
public:
int GetFirstCoreLayerIndex()
member GetFirstCoreLayerIndex : unit -> int
Return Value
Int32
 The index of the first core layer.
Remarks
 This is the index on the exterior side. You can change the shell/core layer boundary using SetNumberOfShellLayers(ShellLayerType, Int32).
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace